#python運算的結果請參考ipynb檔

'''
python數學運算子
運算子	描述	範例
+	加法	5+8
-	減法	90-10
*	乘法	4*7
/	浮點數除法	7 / 2
//	整數除法	7 // 2
%	餘數	7 % 3
**	次方	3 ** 4
'''
#範例：
print((5+8),'加法')
print((90-10),'減法')
print((7/2),'浮點數除法')
print((7//2),'計算商數')
print((7%3),'計算餘數')
print((3**4),'次方計算')

#python的整數
5
print(type(5))

#數字前不可以加0
05

#正整數
print(123)
print(+456)

#負整數
print(-123)
print(-456)

#整數運算
print(5+9)
print(100-7)
print(4-10)

#多個數值運算
print(5+9+3)
print(4+3-2-1+6)

##乘法運算
print(6*7)
print(7*6)
print(6*7*2*3)

#浮點數除法
print(9/5)
print(7//3) #我不太懂在非整除顯示的答案最後一個數字會是顯示5，而非4

#整數除法(只顯示商數)
print(9/5)
    #除數不可為0，否則會………
print(5/0)
    #輸出紶果：ZeroDivisionError: division by zero

#使用變數運算
a=95
print(a)
print(a-3)

#運算結果也可以變成變數
a=95
print(a)
temp=a-3
a=temp
print(a)
#簡化後寫法
a=a-3
a #這邊我不懂，為什麼沒有宣告變數，它卻知道a是95咧？

#餘數計算
print(9%5)

#divmod ->同時得到商與餘數
#語法(被除數,除數)
divmod(7,3)
#答案(2, 1)

#數學運算子優先順序
#先括孤()->次方**->正負數+- ->乘除法* / % //->加減法+- ->等於=
print(2+3*4)
#先算3*4 --->12
#然後再加2 --->14
print((2+3)*4)
#先算2+3 --->5
#再算5*4 --->20
print(2*(1+2)**2-2**2*2)
#先算1+2 --->2*3**2-2**2*2
#再算3**2及2**2 --->2*9-4*2
#再算2*9及4*2 --->18-8
#答案是10

#10進位轉換為2/8/16進位
'''
表示	進位
0b 0B	2進位
0o 0O	8進位
0x 0X	16進位
'''
print(10),print(type(10))
#在2進制輸入10
print(0b10)
#在8進制輸入10
print(0o10)
#在16進制輸入10
print(0x10)